Tekla Open API Reference for Tekla Structures 2025
AnalysisBeamEnd.Connectivity Property
 Gets or sets the connectivity at the beam end.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisConnectivity Connectivity { get; set; }
Public Property Connectivity As AnalysisConnectivity
	Get
	Set
Property Value
Type: AnalysisConnectivity
See Also
Reference
AnalysisBeamEnd Class
Tekla.Structures.Analysis Namespace